# -*- coding:utf-8 -*-
# B站课集: P22
# 开发时间: 2021/3/13 $ 15:03

# 1.赋值运算符 运算顺序从右边到左边
a1 = 1 + 2

# 1.2链式赋值运算
# 得到下面的结论,输出的标识都是相同的.
b1 = b2 = b3 = 20
print(b1, id(b1))  # (20, 42557872L)
print(b2, id(b2))  # (20, 42557872L)
print(b3, id(b3))  # (20, 42557872L)

# 2.支持参数赋值
c1 = 2

# 2.1加法
c1 += 2
print(c1)  # 4

# 2.2乘法
c1 *= 2
print(c1)  # 8

# 3.支持解构赋值
d1, d2, d3 = 10, 20, 30
print(d1, d2, d3)  # 10,20,30

# 3.1出现报错的情况
# d1, d2 = 10, 20, 30  # 因为左右两边变量的个数和值得个数不对应


# 4.交换变量
a, b = 1, 2
a, b = b, a
print(a, b)  # 2,1
